ErpTest/src/Catalogs/ШаблоныВводаНефинансовыхПоказателей/ШаблоныВводаНефинансовыхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныВводаНефинансовыхПоказателей</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПредставлениеПоказателей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФормыВводаПоказателей</name>
    <type>
      <types>EnumRef.ТипыФормШаблоновНефинансовыхПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказателиВТабличнойЧасти</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоказателиШаблона</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.НефинансовыеПоказателиБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Заполнять</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СхемаКомпоновкиДанных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеСхемыКомпоновкиДанных</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеНастроекКомпоновкиДанных</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РедактироватьВСтроках</name>
    <attributes>
      <name>Аналитика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РедактироватьВШапке</name>
    <attributes>
      <name>Аналитика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗначенияСложнойТаблицыПоУмолчанию</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DocumentRef</types>
        <types>EnumRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РедактироватьВКолонках</name>
    <attributes>
      <name>Аналитика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ErpTest/src/Documents/УстановкаЗначенийНефинансовыхПоказателей/УстановкаЗначенийНефинансовыхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЗначенийНефинансовыхПоказателей</name>
  <comment>Установка значений</comment>
  <registerRecords>InformationRegister.ЗначенияНефинансовыхПоказателей</registerRecords>
  <attributes>
    <name>НефинансовыйПоказатель</name>
    <type>
      <types>CatalogRef.НефинансовыеПоказателиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийУстановкиЗначенийНефинансовыхПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонВвода</name>
    <type>
      <types>CatalogRef.ШаблоныВводаНефинансовыхПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНефинансовыхПоказателей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияКолонок</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DocumentRef</types>
        <types>EnumRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтрокиДокумента</name>
    <attributes>
      <name>НомерСтрокиДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Сценарий</name>
      <type>
        <types>CatalogRef.Сценарии</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПодПериода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>Characteristic.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика6</name>
      <type>
        <types>Characteristic.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КолонкиДокумента</name>
    <attributes>
      <name>НомерСтрокиДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Сценарий</name>
      <type>
        <types>CatalogRef.Сценарии</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПодПериода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>Characteristic.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика6</name>
      <type>
        <types>Characteristic.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>НефинансовыйПоказатель</name>
      <type>
        <types>CatalogRef.НефинансовыеПоказателиБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>31</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗначенияПоказателей</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.НефинансовыеПоказателиБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>31</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/Catalogs/ШаблоныВводаНефинансовыхПоказателей/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ШаблонИспользуетсяВДокументах(Знач Шаблон, Знач ДокументИсключение = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Шаблон) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументИсключение) Тогда
		ДокументИсключение = Документы.УстановкаЗначенийНефинансовыхПоказателей.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ДокументУстановкаЗначений.Ссылка
	                      |ИЗ
	                      |	Документ.УстановкаЗначенийНефинансовыхПоказателей КАК ДокументУстановкаЗначений
	                      |ГДЕ
	                      |	ДокументУстановкаЗначений.ШаблонВвода = &ШаблонВвода
	                      |	И НЕ ДокументУстановкаЗначений.Ссылка = &Исключение");
	
	Запрос.УстановитьПараметр("ШаблонВвода", Шаблон);
	Запрос.УстановитьПараметр("Исключение", ДокументИсключение);
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#Область ОбновлениеИнформационнойБазы

#Область Обработчики_2_4_2

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПустыеЗначенияДляОбработки = БюджетированиеВызовСервера.ЗаменяемыеПустыеЗначенияАналитики();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Таблица.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ШаблоныВводаНефинансовыхПоказателей.ЗначенияСложнойТаблицыПоУмолчанию КАК Таблица
		|ГДЕ
		|	Таблица.Значение В(&ПустыеЗначенияДляОбработки)
		|	И Таблица.Аналитика <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.АналитикиСтатейБюджетов.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ПустыеЗначенияДляОбработки", ПустыеЗначенияДляОбработки);
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяМетаданных = "Справочник.ШаблоныВводаНефинансовыхПоказателей";
	МетаданныеОбъекта = Метаданные.Справочники.ШаблоныВводаНефинансовыхПоказателей;
	
	ПустыеЗначенияДляОбработки = БюджетированиеВызовСервера.ЗаменяемыеПустыеЗначенияАналитики();
	ЗначениеЗамены = БюджетированиеКлиентСервер.ПустоеЗначениеАналитики();
	
	
	ЗапросПоТипамАналитик = Новый Запрос;
	ЗапросПоТипамАналитик.Текст =
	"ВЫБРАТЬ
		|	АналитикиСтатейБюджетов.Ссылка КАК Ссылка,
		|	АналитикиСтатейБюджетов.ТипЗначения КАК ТипЗначения
		|ИЗ
		|	ПланВидовХарактеристик.АналитикиСтатейБюджетов КАК АналитикиСтатейБюджетов";
	
	ТипыАналитик = Новый Соответствие;
	ВыборкаТиповАналитик = ЗапросПоТипамАналитик.Выполнить().Выбрать();
	Пока ВыборкаТиповАналитик.Следующий() Цикл
		ТипыАналитик.Вставить(ВыборкаТиповАналитик.Ссылка, ВыборкаТиповАналитик.ТипЗначения);
	КонецЦикла;
	
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Результат = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуСсылокДляОбработки(
		Параметры.Очередь, ПолноеИмяМетаданных, МенеджерВременныхТаблиц);
		
	Параметры.ОбработкаЗавершена = НЕ Результат.ЕстьДанныеДляОбработки;
	Если Параметры.ОбработкаЗавершена Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Результат.ЕстьЗаписиВоВременнойТаблице Тогда
		Параметры.ОбработкаЗавершена = Ложь;
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОбъектыДляОбработки.Ссылка                      КАК Ссылка
		|ИЗ
		|	ВТОбъектыДляОбработки КАК ОбъектыДляОбработки";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВТОбъектыДляОбработки", Результат.ИмяВременнойТаблицы);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяМетаданных);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			
			Если НЕ Объект = Неопределено Тогда
				Объект.Заблокировать();
				
				ОбъектИзменен = Ложь;
				
				Объект.ОбменДанными.Загрузка = Истина;
				Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
				
				ОбъектИзменен = Ложь;
				
				Для каждого СтрокаТабличнойЧасти Из Объект.ЗначенияСложнойТаблицыПоУмолчанию Цикл
					
					Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Аналитика) Тогда
						ТипАналитики = ТипыАналитик.Получить(СтрокаТабличнойЧасти.Аналитика);
						Значение = БюджетированиеКлиентСервер.ПриведенноеЗначениеАналитики(
						СтрокаТабличнойЧасти.Значение, ТипАналитики);
						Если СтрокаТабличнойЧасти.Значение <> Значение Тогда
							СтрокаТабличнойЧасти.Значение = Значение;
							ОбъектИзменен = Истина;
						КонецЕсли;
					КонецЕсли;
				
				КонецЦикла;
				
				Если ОбъектИзменен Тогда
					ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
				Иначе
					ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
				КонецЕсли;
				
			Иначе
				
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
				
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Выборка.Ссылка);
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяМетаданных);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
